app/views/usrs/index.html.erb

        <td align="center"><%= usr.login %></td>
		<td align="center"><%= pluralize(usr.custom_field.size, "custom_field") %></td>
		<td align="center"><%= pluralize(usr.contact.size, "contact") %></td>
---
SELECT COUNT(*) FROM "custom_fields" WHERE "custom_fields"."usr_id" = ?  [["usr_id", 1]]
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."usr_id" = ?  [["usr_id", 1]]