app/controllers/contacts_controller.rb

SELECT  "usrs".* FROM "usrs" WHERE (2) LIMIT 1
INSERT INTO "contacts" ("name", "mail", "usr_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Frank"], ["mail", "frank@gmail.com"], ["usr_id", 4], ["created_at", "2016-04-17 16:07:30.685151"], ["updated_at", "2016-04-17 16:07:30.685151"]]
---
  def create
  	usr = Usr.find_by(params[:usr_id])

	@contact = Contact.new(contact_params)
	@contact.usr_id = usr.id

    respond_to do |format|
      if @contact.save