app/controllers/custom_fields_controller.rb

  def index
    @custom_fields = CustomField.all
---
SELECT "custom_fields".* FROM "custom_fields"

  def create
  	usr = Usr.find_by(params[:usr_id])

	@custom_field = CustomField.new(custom_field_params)
	@custom_field.usr_id = usr.id

	respond_to do |format|
	  if @custom_field.save
---
INSERT INTO "custom_fields" ("field", "field_type", "usr_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["field", "Endereço"], ["field_type", 1], ["usr_id", 1], ["created_at", "2016-04-17 15:11:13.863870"], ["updated_at", "2016-04-17 15:11:13.863870"]]

  def update
    usr = Usr.find_by(params[:usr_id])
	@custom_field.usr_id = usr.id

    respond_to do |format|
      if @custom_field.update(custom_field_params)
---
UPDATE "custom_fields" SET "usr_id" = ?, "field" = ?, "field_type" = ?, "updated_at" = ? WHERE "custom_fields"."id" = ?  [["usr_id", 1], ["field", "lllllllllllllllllllllllll"], ["field_type", 11111], ["updated_at", "2016-04-18 00:02:29.476406"], ["id", 8]]

    def set_custom_field
      @custom_field = CustomField.find(params[:id])
---
SELECT  "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."id" = ? LIMIT 1  [["id", 3]]