app/controllers/login_controller.rb

SELECT  "usrs".* FROM "usrs" WHERE "usrs"."login" = ? LIMIT 1  [["login", "victor"]]
---
	def create
		usr = Usr.find_by_login(params[:usr][:login])