app/controllers/usrs_controller.rb

SELECT "usrs".* FROM "usrs"
---
  def index
    @usrs = Usr.all

INSERT INTO "usrs" ("name", "login", "pass", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Victor Hugo Bernardo"], ["login", "victor"], ["pass", "victor"], ["created_at", "2016-04-17 14:46:48.931961"], ["updated_at", "2016-04-17 14:46:48.931961"]]
---
  def create
    @usr = Usr.new(usr_params)

    respond_to do |format|
      if @usr.save

UPDATE "usrs" SET "name" = ?, "login" = ?, "pass" = ?, "updated_at" = ? WHERE "usrs"."id" = ?  [["name", "testando"], ["login", "testando"], ["pass", "$2a$10$N8yAzuIkC7v/RgldWa8Xge88C9YDTf3m9uQthuBdl0MCl7q39cBay"], ["updated_at", "2016-04-17 21:17:00.383572"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @usr.update(usr_params)

SELECT  "usrs".* FROM "usrs" WHERE "usrs"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_usr
      @usr = Usr.find(params[:id])